app/views/quiz/play.html.erb

	var score = 0;
	$( document ).on('turbolinks:load', function() {
		$(".question:not(:eq(0))").hide();
		var question_amount = $(".question").length;
		var current_question = 0;
		$(".answer").click( function(){
			$(".question:eq(" + current_question + ")").hide();
			current_question += 1
			$(".question:eq(" + current_question + ")").show();

			if (current_question == question_amount) {
				$("#score").text("Final score:" + score);
			}
		});

	});
---
SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["quiz_id", 50], ["LIMIT", 1]]