app/views/quiz/show.html.erb

<p><b>Category:</b> <%= @quiz.category %></p>
<p><b>Number of Questions:</b> <%= @quiz.questions.count %>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."quiz_id" = $1  [["quiz_id", 42]]