app/controllers/quiz_controller.rb

  def show
    @quiz = Quiz.find_by_name(params[:name])
    @creator = User.find(@quiz.creator_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]